<?php
// Heading
$_['heading_title']       = 'Подарочная карта со скидками';

// Text
$_['text_success']        = 'Список подарочных карт успешно обновлен!';
$_['text_list']           = 'Список подарочных карт';
$_['text_add']            = 'Добавление подарочной карты';
$_['text_edit']           = 'Редактирование подарочной карты';
$_['text_percent']        = 'Проценты';
$_['text_amount']         = 'Фиксированная сумма';

// Column
$_['column_name']         = 'Название';
$_['column_code']         = 'Код';
$_['column_discount']     = 'Скидка';
$_['column_date_start']   = 'Дата начала';
$_['column_date_end']     = 'Дата окончания';
$_['column_status']       = 'Статус';
$_['column_order_id']     = 'Заказ №';
$_['column_customer']     = 'Покупатель';
$_['column_amount']       = 'Сумма';
$_['column_date_added']   = 'Дата добавления';
$_['column_action']       = 'Действие';

// Entry
$_['entry_name']          = 'Название подарочной карты';
$_['entry_code']          = 'Код';
$_['entry_type']          = 'Тип';
$_['entry_discount']      = 'Скидка';
$_['entry_logged']        = 'Авторизация пользователя';
$_['entry_shipping']      = 'Бесплатная доставка';
$_['entry_total']         = 'Итого';
$_['entry_category']      = 'Категория';
$_['entry_product']       = 'Товары';
$_['entry_date_start']    = 'Дата начала';
$_['entry_date_end']      = 'Дата окончания';
$_['entry_uses_total']    = 'Количество применений подарочной карты';
$_['entry_uses_customer'] = 'Количество применений одним покупателем';
$_['entry_status']        = 'Статус';

// Help
$_['help_code']           = 'Код который покупатель должен ввести что бы получить указанную ниже скидку.';
$_['help_type']           = 'Тип скидки, фиксированная сумма или в процентах.';
$_['help_logged']         = 'Пользователь должен авторизоваться, чтобы использовать подарочную карту.';
$_['help_total']          = 'Сумма в корзине, ниже которой подарочная карта не будет работать.';
$_['help_category']       = 'Выбрать все товары в указанной категории.';
$_['help_product']        = 'Выберите товар, к которому применять подарочную карту. Если товар не выбран, то подарочная карта будет действовать на всю корзину.';
$_['help_uses_total']     = 'Сколько раз максимально может использоваться подарочную карту. Для бесконечного использования оставить пустым.';
$_['help_uses_customer']  = 'Сколько раз максимально может использоваться подарочную карту одним покупателем. Для бесконечного использования оставить пустым.';

// Error
$_['error_permission']    = 'У вас нет прав для редактирования подарочных карт!';
$_['error_exists']        = 'ВНИМАНИЕ: Этот код уже используется в другой подарочной карте!';
$_['error_name']          = 'Название подарочной карты должно быть от 3 до 128 символов!';
$_['error_code']          = 'Код подарочной карты должен быть от 3 до 10 символов!';
